interview-api/app/controllers/interviews_controller.rb

SELECT "interviews".* FROM "interviews"
---
  def index
    @interviews = Interview.all

SELECT "participants".* FROM "participants" WHERE "participants"."email" = ?  [["email", "a@g.com"]]
SELECT COUNT(*) FROM "participants" WHERE "participants"."email" = ?  [["email", "c@g.com"]]
INSERT INTO "interviews" ("title", "starttime", "endtime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new1"], ["starttime", "2020-01-04 03:40:00"], ["endtime", "2020-01-04 03:40:00"], ["created_at", "2020-01-09 18:29:39.538998"], ["updated_at", "2020-01-09 18:29:39.538998"]]
INSERT INTO "participants" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "c@g.com"], ["email", "c@g.com"], ["created_at", "2020-01-09 19:40:26.063320"], ["updated_at", "2020-01-09 19:40:26.063320"]]
---
  def create
    # puts interview_params.inspect
    @interview = Interview.new(interview_params)
    params[:participant_ids].each do |participant_id|
      if participant_id != ""
        participant = Participant.where(:email => participant_id)
        if participant.count != 0
          @interview.participants << participant

SELECT "participants".* FROM "participants" WHERE "participants"."email" = ?  [["email", "c@g.com"]]
SELECT COUNT(*) FROM "participants" WHERE "participants"."email" = ?  [["email", "c@g.com"]]
UPDATE "interviews" SET "title" = ?, "starttime" = ?, "endtime" = ?, "updated_at" = ? WHERE "interviews"."id" = ?  [["title", "new13"], ["starttime", "2020-01-04 03:49:00"], ["endtime", "2020-01-04 03:49:00"], ["updated_at", "2020-01-10 05:06:50.100712"], ["id", 12]]
SELECT "participants".* FROM "participants" INNER JOIN "interviews_participants" ON "participants"."id" = "interviews_participants"."participant_id" WHERE "interviews_participants"."interview_id" = ?  [["interview_id", 12]]
---
  def update
    #puts interview_params.inspect
    @interview.participants.clear
    params[:participant_ids].each do |participant_id|
      if participant_id != ""
        participant = Participant.where(:email => participant_id)
        if participant.count != 0
          @interview.participants << participant
        else
          participant2 = Participant.new(:name => participant_id, :email => participant_id)
          if participant2.save
            @interview.participants << participant2
          end
        end
      end
    end
    if @interview.update(interview_params)
      participants = @interview.participants
      t = @interview.starttime
      start = DateTime.new(t.year,t.month,t.day,t.hour,t.min,t.sec).utc.to_i
      current = Time.now
      current = DateTime.new(current.year,current.month,current.day,current.hour,current.min,current.sec).utc.to_i
      emails = []
      participants.each do |p|

DELETE FROM "interviews" WHERE "interviews"."id" = ?  [["id", 11]]
---
  def destroy
    # participants = @interview.participants
    # emails = []
    # participants.each do |p|
    #   emails += [p.email]
    #   SchedulerMailer.delete_email(p.email).deliver_now
    # end
    @interview.destroy