interview-api/app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT "participants".* FROM "participants"

  def create
    @participant = Participant.create(participant_params)
---
INSERT INTO "participants" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Arindam"], ["email", "a@g.com"], ["created_at", "2020-01-09 09:23:06.348111"], ["updated_at", "2020-01-09 09:23:06.348111"]]